Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: If the condition expression is false when the while loop is first reached, the body is never evaluated.
ja: 条件式の評価が偽に初めてなると、その後、本体は決して評価されません。

source: If the condition expression is false
ja: 条件式がfalseである場合

source: If the expression x < y is true, the entire ternary operator expression evaluates to the string "less than" and otherwise it evaluates to the string "not less than".
ja: 式x < yが真の場合、三項演算子の式全体は、文字列 "less than" に評価され、偽の場合は文字列 "not less than" に評価されます。

source: If the left-hand side is an array-indexing expression, e.g. X[2:end] .= sin.(Y), then it translates to broadcast! on a view, e.g. broadcast!(sin, view(X, 2:lastindex(X)), Y), so that the left-hand side is updated in-place.
ja: 左側が配列インデックス式である場合は たとえばX[2:end].=sin.(Y)、次のようにビューで<X21/>ブロードキャスト!に変換されます。 ブロードキャスト!(sin,view(X,2:lastindex(X)),Y) 左側がインプレイス更新されます。

source: If the manifest stanza matching uuid has a path entry, use that path relative to the manifest file.
ja: uuidと一致するマニフェスト・スタンザがパスのパスを持つ場合は、マニフェスト・ファイルに対してそのパスを使用します。

source: If the memory is already owned by Julia, or is an isbits type, and is known to be non-null:
ja: メモリが既にJuliaによって所有されている場合、またはイスビトスタイプであり、非NULLであることが知られている場合は、次のように指定します。

source: If the memory is owned by C:
ja: メモリがC:に所有されている場合

source: If the numerator and denominator of a rational have common factors, they are reduced to lowest terms such that the denominator is non-negative:
ja: 有理の分子と分母が共通の因子をもつ場合には、それらは最小に減少する 分母が負でないことを示す用語。

source: If the patchwork is well designed, even though the implementations of the methods may be quite different, the outward behavior of the function will appear seamless and consistent.
ja: パッチワークがうまく設計されていれば、メソッドの実装がかなり異なっていても、外側からは関数の動作は継ぎ目なく一貫しているように見えます。

source: If the pointer of interest is a plain-data array (primitive type or immutable struct), the function `unsafe_wrap(Array, ptr,dims, own = false)`
ja: 関心のあるポインタがプレーン・データ・アレイ(プリミティブ・タイプまたは不変構造体)である場合、関数'unsafe_wrap(Array,ptr,dims,own=false)`

source: If the same X package is imported multiple times in the same Julia session, it is only loaded the first time—on subsequent imports, the importing module gets a reference to the same module.
ja: 同じx9/>パッケージが同じジュリアセッションに複数回インポートされた場合は、最初にインポートされたときにのみ読み込まれます。インポートモジュールは、同じモジュールへの参照を取得します。

source: If the type T is omitted it will default to `Float64`.
ja: Tの場合 省略すると、デフォルトでは"Float64になります。

source: If the type were declared mutable, you could reach in and directly change the field values to violate this invariant.
ja: タイプが宣言されている場合は、mutableの値を入力すると、フィールド値を入力して、フィールド値を直接変更することができます。 この不変に違反します。

source: If the variable i has not been introduced in an other scope, in the for loop form, it is visible only inside of the for loop, and not afterwards.
ja: forループ方式の時は、変数iが、他のスコープにとりこまれていない場合、変数は forループの内部でのみ見えて、その後ろでは見えません。

source: If the variable i has not been introduced in another scope, in the for loop form, it is visible only inside of the for loop, and not outside/afterwards.
ja: 変数iが別の変数に導入されていない場合 ループ形式のでは、ループの場合はの内部でのみ可視となります。 その後になります。

source: If there is no manifest file, graph is empty.
ja: マニフェストファイルが存在しない場合、グラフは空である。

source: If there is only a single parameter, the enclosing curly braces (in where {T}) can be omitted, but are often preferred for clarity.
ja: パラメータが1つしかない場合は、中括弧（where {T}）を省略することができますが、わかりやくするために、よく好んでつけられます。

source: If this example were rewritten to use a for keyword for each variable, then the output would be different: the second and fourth values would contain 0.
ja: この例が、各変数ごとにキーワードに対してを使用するように書き直された場合、出力は次のようになります。 異なる値:2番目と4番目の値は0を含むことになります。

source: If you are defining an array type that allows non-traditional indexing (indices that start at something other than 1), you should specialize `axes`.
ja: 非伝統的なインデックスを作成するための配列タイプを定義する場合は 1以外のものは、'の軸を特殊化してください。

source: If you call it in an interactive session without assigning the return value anywhere, you will see the tuple returned:
ja: これを対話型セッションで呼び出しても、戻り値はどこにも割り当てられない場合は 戻されたタプルを参照してください。

source: If you define your own equality function, you should probably define a corresponding `hash()` method to ensure that isequal(x,y) implies hash(x) == hash(y).
ja: もし等値関数を定義したい場合は、`hash()` メソッドを定義して、するisequal(x,y)が hash(x) == hash(y)を表すように保証することをお勧めします。

source: If you define your own equality function, you should probably define a corresponding `hash` method to ensure that isequal(x,y) implies hash(x) == hash(y).
ja: 定義する場合 独自の等価性関数は、おそらく対応する'ハッシュ''メソッドを定義する必要があります。 isequal(x,y)がハッシュ(x)==hash(y)を意味することを保証する。

source: If you define a fourth method that is more specialized for integers:
ja: 整数に特化した4番目のメソッドを定義した場合は、次のようになります。

source: If you define a function expecting a string argument, you should declare the type as AbstractString in order to accept any string type.
ja: 文字列の引数を扱う関数を定義する場合は、任意の文字列型を使用するために AbstractString を型として宣言する必要があります。

source: If you don't specify this trait, the default value IndexCartesian() is used.
ja: もしあなたが この特性を指定します。デフォルト値IndexCartesian()は使用されます。

source: If you find that something is slow, we highly recommend reading through the :ref:`man-performance-tips` section before trying anything else.
ja: JuliaのコンパイラはPythonやRで使われるようなインタプリタとは異なるので、もしかしたら最初はその性能に気づかないかもしれません。 遅いと感じたら、何かを試す前に :ref:`man-performance-tips` を参照することをお勧めします。

source: If you find that something is slow, we highly recommend reading through the Performance Tips section before trying anything else.
ja: JuliaのコンパイラはPythonやRで使われるようなインタプリタとは異なるので、もしかしたら最初はその性能に気づかないかもしれません。 遅いと感じたら、何かを試す前に Performance Tips を参照することをお勧めします。

source: If you have code that you want executed whenever Julia is run, you can put it in ~/.juliarc.jl:
ja: Juliaの起動時に毎回実行したいコードがあれば、 ~/.juliarc.jl に書いておくことができます。

source: If you have code that you want executed whenever Julia is run, you can put it in /.julia/config/startup.jl:
ja: Juliaの起動時に毎回実行したいコードがあれば、 /.julia/config/startup.jl に書いておくことができます。

source: If you have code that you want executed whenever Julia is run, you can put it in ~/.julia/config/startup.jl:
ja: Juliaの起動時に毎回実行したいコードがあれば、 /.julia/config/startup.jl に書いておくことができます。

source: If you have code that you want executed whenever Julia is run, you can put it in /.juliarc.jl:
ja: Juliaの起動時に毎回実行したいコードがあれば、 ~/.juliarc.jl に書いておくことができます。

source: If you index into a string at such an invalid byte index, an error is thrown:
ja: このような無効なバイトインデックスで文字列にインデックスを付けた場合、例外が投げられます。:

source: If you iterate through the indices 1 through `endof(s)`
ja: インデックス1から `endof(s)`まで繰り返し処理を行い、

source: If you iterate through the indices 1 through `lastindex(s)`
ja: インデックス1から `lastindex(s)`まで繰り返し処理を行い、

source: If you just want to install and use packages, simply use Julia's built-in package manager to add packages to your environment and write import X or using X in your code to load packages that you've added.
ja: パッケージをインストールして使用する場合は、Juliaの組み込みパッケージ・マネージャーを使用して、パッケージを環境に追加し、Xを使用してx2/>を記述するか、Xを使用して、追加したパッケージをロードしてください。

source: If you try this at the REPL, you get the error:
ja: これを REPLはエラーを受け取ります。

source: If you want to import a module but only use its symbols inside a specific function or set of functions, you have two options:
ja: 必要な場合 モジュールをインポートするために、特定の関数または関数のセット内のシンボルのみを使用するには、次のようにします。 には次の2つのオプションがあります。

source: If you want to check that each converted value is a valid code point, use the `isvalid()` function:
ja: もし変換された値が有効なコードポイントであるか確認したい場合は、`isvalid()`関数を使用してください。:

source: If you want to check that each converted value is a valid code point, use the `isvalid` function:
ja: もし変換された値が有効なコードポイントであるか確認したい場合は、`isvalid()`関数を使用してください。:

source: If you want to extract a character from a string, you index into it:
ja: 文字列から文字を抽出する場合はその文字列にインデックスを添える必要があります。:

source: If you want your Julia process to have access only to the packages in one project or package directory, make it the only entry in LOAD_PATH.
ja: Juliaプロセスを1つのプロジェクトまたはパッケージディレクトリのパッケージにのみアクセスできるようにする場合は、LOAD_PATHのLOAD_PATHのエントリだけを作成します。

source: If you wish to specialize on a particular style DestStyle, define a method for
ja: 特定のスタイルDestStyleに特化する場合は、次の方法を定義します。

source: If you write a custom `AbstractArray` type, you can specify that it has fast linear indexing using
ja: カスタム`AbstractArray'タイプを書く場合は、次のようにして、高速な線形インデックスを作成することを指定できます。

source: If your array type does have fixed dimensionality requirements, then you should subtype AbstractArrayStyle.
ja: 配列タイプに固定次元要件がある場合は、次の操作を行います。 サブタイプAbstractArrayStyle。

source: If, on the other hand, Julia was loading the other
ja: 一方、Juliaが他のをロードしていた場合

source: Implementation
ja: 実装

source: Important optional methods
ja: 重要なオプションのメソッド

source: In this case the name is resolved within the current process.
ja: の この場合、名前は現在のプロセス内で解決されます。

source: In Julia code wrapping calls to external C routines, ordinary (non-pointer) data should be declared to be of type T inside the `ccall`, as they are passed by value.
ja: 外部Cルーチンへの呼び出しをラップするJuliaコードでは、通常の(ポインタ以外の)データを宣言する必要があります。 の中でTであり、それらは値を通過して渡される。

source: In Julia code wrapping calls to external Fortran routines, all input arguments should be declared as of type Ref{T}, as Fortran passes all variables by pointers to memory locations.
ja: 外部Fortranルーチンへの呼び出しをラップするJuliaコードでは、すべての入力引数が は、Fortranがすべての変数を通過するので、Ref{T}の形式で宣言する必要があります。 メモリ位置へのポインタ。

source: In Julia these are very different things.
ja: Juliaでは Char 型と String 型はとても異なったものです。

source: In Julia, a function is an object that maps a tuple of argument values to a return value.
ja: Juliaでは、関数は引数値のタプルを戻り値に写像するオブジェクトです。

source: In Julia, all arguments to functions are passed by sharing
ja: Juliaでは、関数に対するすべての引数は、に渡されます。 共有

source: In Julia, exceeding the maximum representable value of a given type results in a wraparound behavior:
ja: Juliaでは、指定された型の表現可能な最大値を超えた場合、ワードラップが発生します。:

source: In Julia, most operators are just functions with support for special syntax.
ja: Juliaでは、ほとんどの演算子は、特殊な構文をとっていても、単なる関数です。

source: In Julia, the binding of a variable x cannot be changed by passing x as an argument to a function.
ja: Juliaでは、変数xの結合は、関数の引数としてxを渡すことで変更することはできない。

source: In Julia, type objects also serve as constructor functions: they create new instances of themselves when applied to an argument tuple as a function.
ja: ジュリアでは、オブジェクトもコンストラクタ関数として機能します。これらは、自分自身の新しいインスタンスを作成するためのものです。 関数として引数タプルに適用されます。

source: In Julia, types are themselves run-time objects, and can also be used to convey information to the compiler.
ja: Juliaでは、型そのものが実行時オブジェクトとなり、同時にコンパイラに対して情報を伝えるために利用できます。

source: In Julia, vectorized functions are not required for performance, and indeed it is often beneficial to write your own loops (see (@ref man-performance-tips)), but they can still be convenient.
ja: ジュリアではベクトル化された関数は はパフォーマンスに必要なではありません。実際には、独自のループを作成することが有益です( (@ref man-performance-tipsはありますが、それでも便利です。

source: In Julia, we can access the parts independently to make a copy of that string:
ja: Juliaでは、その文字列のコピーを作成するために、パーツに独立してアクセスすることができます。

source: In UTF-8, ASCII characters -- i.e. those with code points less than 0x80 (128) -- are encoded as they are in ASCII, using a single byte, while code points 0x80 and above are encoded using multiple bytes -- up to four per character.
ja: UTF-8では、ASCII、つまり0x80(128)以下のコードポイントの文字は 1バイトでASCIIとしてエンコードされ、0x80以上のコードポイントは、1文字あたり最大4バイトのマルチバイトでエンコードされます。

source: In a Unix-like environment, a reliable way to pass options to julia in an executable script would be to start the script as a bash script and use exec to replace the process to julia:
ja: Unixライクな 環境、信頼できる方法でjuliaにオプションを渡すことができます。 実行可能スクリプトは、スクリプトをbashスクリプトとして起動します。 execを使用して、プロセスをジュリアに置き換えます。

source: In addition to these Unicode escape forms, all of C's traditional escaped input forms
ja: これらのUnicodeエスケープ方式に加えて、 C言語のエスケープ形式 C's traditional escaped input forms（訳注:ウィキペディア英語版）を用いた入力も可能です。:

source: In addition to all the iterable and indexable methods from above, these types can also interact with each other and use most of the methods defined in Julia Base for AbstractArrays:
ja: これらのタイプは、上記のすべてのiterableメソッドとindexableメソッドに加えて、相互作用することもできます。 AbstractArraysのために、Julia Baseで定義されたほとんどのメソッドをお互いに使用します。

source: In addition to the above, some advantages of Julia over comparable systems include:
ja: これに加え、Juliaは以下のような長所を持ちます。

source: In addition to this manual, there are various other resources that may help new users get started with Julia:
ja: 新しいユーザを支援するための有用な学習リソースのリストは、Julia Webサイトの学習ページに掲載されています。

source: In all cases the ambiguity is resolved in favor of interpretation as numeric literals:
ja: すべての場合に、あいまいさは数値リテラルとして解釈されるために解決されます。

source: In any indexing expression, the keyword end can be used as a shorthand for the last index (computed by `endof(str)`).
ja: どのインデックス表現でも、キーワード end は（`endof(str)`) で求められる）インデックスの末尾の省略形として使うことができます。

source: In applications where overflow is possible, explicit checking for wraparound produced by overflow is essential; otherwise, the `BigInt` type in Arbitrary Precision Arithmetic
ja: オーバーフローを許容するアプリケーションでは、オーバーフローにより発生したワードラップの明示的なチェックは不可欠です。 チェックが難しい場合は、任意精度計算Arbitrary Precision Arithmetic の `BigInt`型を使用することをお勧めします。

source: In both cases, we resolve the ambiguity in favor of interpretation as a numeric literals:
ja: 上記両ケースでは、優先的に数値リテラルとして解釈されるようにすることで、あいまいさを回避しています。

source: In combination, these goals lead to a more complex package loading mechanism than most dynamic languages have, but it also yields scalability and reproducibility that is more commonly associated with static languages.
ja: これらの目標は、多くの動的言語に比べて、より複雑なパッケージロードメカニズムにつながりますが、静的言語により一般的に関連するスケーラビリティーと再現性も得られます。

source: In conjunction with other control flow, however, return
ja: けれども、実行順序を制御する場合、returnは役に立ちます。

source: In contrast with for i = 1:length(A), iterating with `eachindex` provides an efficient way to iterate over any array type.
ja: i=1:長さ(A)のとは対照的に、'の反復は、効率的な方法である。"エアチンデス"である 任意の配列タイプに対して繰り返します。

source: In contrast, pointers returned by the C function called should be declared to be of output type `Ptr{T}`, reflecting that the memory pointed to is managed by C only.
ja: これとは対照的に、呼び出されるC関数によって返されるポインタは、出力型であることが宣言されるべきです。 `Ptr{T}は、メモリがCによって管理されていることを示しています。

source: In contrast, preprocessor "macro" systems, like that of C and C++, perform textual manipulation and substitution before any actual parsing or interpretation occurs.
ja: これとは対照的に、プリプロセッサ「マクロ」システムは、CおよびC++のシステムと同様に、テキスト操作を実行します。 実際の構文解析または解釈の前に置換する必要があります。

source: In fact, f.(args...)
ja: 実際には、f.(args.)です。

source: In fact, `macroexpand`
ja: 実際には、`macroexpand`です。

source: In fact, Point{T} is a distinct constructor function for each type T.
ja: 実際、ポイント{T}は、それぞれのタイプTに対して個別のコンストラクタ関数である。

source: In fact, the Pub package has started to use it.
ja: 実際には、Pubパッケージが使用されるようになりました。

source: In general, a broadcast operation is represented by a lazy Broadcasted container that holds onto the function to be applied alongside its arguments.
ja: 一般的に、ブロードキャスト動作は 引数と共に適用される関数です。

source: In general, the for loop construct can iterate over any container.
ja: 一般に、forループはどのコンテナに対しても反復処理が可能です。

source: In general, unlike many other technical computing languages, Julia does not expect programs to be written in a vectorized style for performance.
ja: 一般的に、多くの他の技術計算言語とは異なり、Juliaはプログラムを期待していない。 パフォーマンスを向上させるためにベクトル化されたスタイルで記述する必要があります。

source: In mathematics, + usually denotes a commutative operation, where the order of the operands does not matter.
ja: 数学では、+ はしばしば commutative 可換 演算（被演算子の順番が関係ない演算）を表します。

source: In more complex cases, resolving method ambiguities involves a certain element of design; this topic is explored further (@ref man-method-design-ambiguities).
ja: より複雑なケースでは、メソッドの曖昧さを解決するには一定の設計要素が必要になります。この話題は[below]（@ ref man-method-design-ambiguities）をさらに詳しく解説しています。

source: In order to compute trigonometric functions with degrees instead of radians, suffix the function with d.
ja: ラジアンではなく角度で三角関数を計算するためには、 d を関数の末尾に付与してください。

source: In order to control the type explicitly, a type can be prepended to the comprehension.
ja: 制御を行うには 明示的にタイプを認識することができます。

source: In order to define a new display backend, one should first create a subtype D of the abstract class AbstractDisplay.
ja: 新しい表示バックエンドを定義するには、まず抽象のサブタイプDを作成する必要があります。 クラスAbstractDisplay。

source: In order to implement such a copy or copyto!, method, of course, you must work with the Broadcasted wrapper to compute each element.
ja: このようなコピーまたはコピーを実装するには、もちろん、メソッドを使用する必要があります。 ブロードキャストされたラッパーを使用して、各要素を計算します。

source: In order to pass this function to C, we obtain its address using the macro @cfunction:
ja: この関数をCに渡すためには、マクロ@cfunction:を使ってアドレスを取得します。

source: In order to support indexing with ranges or vectors of Ints, separate methods must be written:
ja: Intの範囲またはベクトルを用いたインデックス作成をサポートするためには、別の方法を記述する必要があります。

source: In other words, while developing you might use a workflow something like this:
ja: その他 開発中にワークフローを使用することができます。

source: In other circumstances, it is handy to be able to stop an iteration and move on to the next one immediately.
ja: 他の状況では、反復を停止して次のイテレーションに移動することは便利です。 のようになります。

source: In other words, if the path to our example project directory is /home/me/animals then the paths map could be represented by this dictionary:
ja: 言い換えれば、サンプルプロジェクトディレクトリへのパスが/home/me/animalsであれば、のパスはこの辞書によって表現されます。

source: In other words, if we have stack = [env₁, env₂, …] then we have:
ja: つまり、スタック=[env1,env2,…]の場合は、次のようになります。

source: In other words, the $ expression "belongs to" the inner quote expression, and so its argument is only evaluated when the inner quote expression is:
ja: つまり、$式は内部引用符式に属していて その引数は、内部引用符式が次のような場合にのみ評価されます。

source: In other words, the binary representation is truncated to fit.
ja: 言い換えれば、バイナリ表現は値に収まるように切り捨てられます。

source: In other words, the representable floating-point numbers are densest in the real number line near zero, and grow sparser exponentially as one moves farther away from zero.
ja: い換えれば、浮動小数点数は実数線上で0に近い場合に最も高密度になり、 0から離れるにつれてまばらになっていきます。

source: In particular, nested dot calls like f.(g.(x))
ja: 特に、f.(g.(x))のようなネストされたドットコール

source: In particular, this means that import X can refer to different packages depending on context.
ja: 特に、インポートXは、コンテキストに応じて異なるパッケージを参照することができます。

source: In particular, you can write C-style string code to process ASCII strings, and they will work as expected, both in terms of performance and semantics.
ja: 特に、ASCIIの文字列を処理するためにC言語スタイルに文字列コードを書くことができ、パフォーマンスと乞うっ文的な意味の両面で期待通りの動作をします。

source: In particular, you'll need to set up a two-layered system: the C callback should only schedule (via Julia's event loop) the execution of your "real" callback.
ja: 特に、2層を設定する必要があります。 システム:Cコールバックは、スケジュール(ジュリアのイベントループ経由)を実行して、"実"を実行することができます。 コールバック。

source: In practice, especially when providing reusable functionality, one generally wraps `ccall`
ja: 実際には、特に再利用可能な機能を提供する場合には、一般的には"ccall""をラップします。

source: In realistic usage there is more code to be evaluated after the continue, and often there are multiple points from which one calls continue.
ja: 現実的な使い方で continue以降に評価されるコードが多くあり、多くの場合、以下のような複数のポイントが存在します。 これはを続けてを続けます。

source: In some cases it might be convenient not to have to define MyStyle, in which case you can leverage one of the general broadcast wrappers:
ja: 場合によっては、MyStyleを定義しなくてもよい場合があります。この場合は、次のような操作を行います。 一般的なブロードキャストラッパーの一つを活用する。

source: In some cases, types will want to additionally specialize those extra behaviors when they know a more efficient algorithm can be used in their specific case.
ja: 場合によっては、タイプが必要になることがあります。 さらに効率的なアルゴリズムを知っているときにそれらの余分な行動を追加的に専門化すること 特定の場合に使用されます。

source: In some contexts, operators can be used just like variables; for example (+) refers to the addition function, and (+) = f will reassign it.
ja: ある文脈では、 演算子は変数のように使用することができます。例えば、 (+)は足し算を意味し、 (+) = fは 再代入を行います。

source: In static languages, on the other hand, while one can – and usually must – annotate types for the compiler, types exist only at compile time and cannot be manipulated or expressed at run time.
ja: 一方静的言語においては、コンパイラのために型注釈をつけることができます（ほぼ必須でしょう）が、型の情報はコンパイル時にのみ存在し、実行時には操作したり取得したりすることができません。

source: In static languages, on the other hand, while one can — and usually must — annotate types for the compiler, types exist only at compile time and cannot be manipulated or expressed at run time.
ja: 一方静的言語においては、コンパイラのために型注釈をつけることができます（ほぼ必須でしょう）が、型の情報はコンパイル時にのみ存在し、実行時には操作したり取得したりすることができません。

source: In such cases, it may be best for the exceptional condition to either terminate the program while printing a diagnostic error message, or if the programmer has provided code to handle such exceptional circumstances then allow that code to take the appropriate action.
ja: このような場合、例外的な条件は、次のいずれかの方法で終了することが最善の条件になります。 診断エラー・メッセージの印刷中、またはプログラマがコードを処理するためのコードを提供している場合はプログラム このような例外的な状況は、そのコードが適切なアクションをとることを可能にします。

source: In such cases, it may be best for the exceptional condition to either terminate the program, printing a diagnostic error message, or if the programmer has provided code to handle such exceptional circumstances, allow that code to take the appropriate action.
ja: そんな例外的な状況に対する最善の策は、プログラムを終了させることかもしれないし、状況を報告するエラーメッセージを出力することかもしれません。また、プログラマが例外的な状況に対応するコードを用意している場合は、そのコードに適切な処置をとらせることかもしれません。

source: In such cases, the result is always 1-d.
ja: この場合、結果は常に1-dになります。

source: In such cases, you may need or want to evaluate x .* (x .+ 1) as if it had been written broadcast(*, x, broadcast(+, x, 1)), where the inner operation is evaluated before tackling the outer operation.
ja: このような場合は x.*(x .+ 1)を必要とするか、または評価する必要があるかを判断します。 ブロードキャスト(*,x,ブロードキャスト(+, x, 1))で、インナー操作は事前に評価されます。 外部操作に取り組んでいます。

source: In such situations, it is generally clear from the context that the term is used to mean "constructor method" rather than "constructor function", especially as it is often used in the sense of singling out a particular method of the constructor from all of the others.
ja: このような状況では、一般的には、この用語は は、「コンストラクタ関数」ではなく「コンストラクタメソッド」を意味するために使用されます。特に コンストラクタの特定のメソッドを、他のすべてのコンストラクタから削除するという意味で使用されます。

source: In technical-computing languages, it is common to have "vectorized" versions of functions, which simply apply a given function f(x) to each element of an array A to yield a new array via f(A).
ja: 技術計算言語では、関数の「ベクトル化」バージョンが一般的であることが一般的です。 単純に与えられた関数f(x)を配列Aの各要素に適用して、新しい配列を生成する。 f(A)。

source: In the Julia REPL and several other Julia editing environments, you can type many Unicode math symbols by typing the backslashed LaTeX symbol name followed by tab.
ja: REPLおよび他のJuliaの編集環境では、バックスラッシュを伴うLaTex記号とタブを 入力することで、Unicode数学記号を入力することが可能です。

source: In the REPL, included paths are interpreted relative to the current working directory, pwd().
ja: REPLでは、含まれるパスは、現在のワーキングディレクトリpwd()に相対的に解釈されます。

source: In the absence of a type declaration with ::, the type of a method parameter is Any by default, meaning that it is unconstrained since all values in Julia are instances of the abstract type Any.
ja: ::による型宣言がない場合、メソッドのパラメータの型はデフォルトではAnyであり、Juliaのすべての値が抽象型Anyのインスタンスであるため、制約がないことを意味しています 。

source: In the assignment form, the body of the function must be a single expression, although it can be a compound expression (see (@ref man-compound-expressions)).
ja: 代入方式では、関数の本体は単一の式でなければなりませんが、その式は複合式( (@ref man-compound-expressions)を参照)でもかまいません。

source: In the case of leading zeros, the size is determined by the minimal needed size for a literal, which has the same length but leading digit 1.
ja: 先行ゼロの場合、サイズは、必要最小限のサイズで決定されます。 リテラルは同じ長さですが、先頭桁はx3/>1です。

source: In the context of an expression, symbols are used to indicate access to variables; when an expression is evaluated, a symbol is replaced with the value bound to that symbol in the appropriate (@ref scope-of-variables).
ja: 式のコンテキストでは、シンボルは変数へのアクセスを示すために使用されます。式の場合は、次のようになります。 は評価され、シンボルは該当する(変数の@ref scope of variables)内のそのシンボルにバインドされた値に置き換えられます。
